[X2Effect_MecOverheat]
BurningFriendlyName=“过热”
BurningFriendlyDesc="过热的单位将无法行动，因为它们会排出行动中的热量。"
BurningEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 过热。"
BurningEffectTickedString="<XGParam:StrValue0/!UnitName/> 仍然过热。"
BurningEffectLostString="<XGParam:StrValue0/!UnitName/> 不再过热。"

[UIPersonnel_MECTraining]
EmptyListMessage="没有增强候选者"
MecsUnavailable="无 MEC FOUNDRY 升级"
NotEnoughResources="没有足够的资源用于增强"
BuildFoundry="构建 MEC FOUNDRY"
MeetTechRequirement="研究 MEC 技术"
MeetStoryRequirement="完成失落塔楼/研究机械化战争"


m_strTitle="候选人"
m_strEmptyListLabels[eUIPersonnel_Soldiers]="无增强候选者"

[UIFacility_MecAugmentationSlot]
m_strAugmentSoldierDialogTitle="增强士兵"
m_strAugmentSoldierDialogText="<XGParam:StrValue0/!UnitName/> 可以接受专门手术成为一名 MEC 士兵，以 <XGParam:IntValue0/> 补给品、<XGParam:IntValue1/> 元素核心取代他们之前的职业，和 <XGParam:IntValue2/> 结晶融合一旦开始就不可逆转。您想继续吗？”
m_strNoSoldiersTooltip="没有可用于 MEC 士兵增强的士兵"
m_strSoldiersAvailableTooltip="增强士兵成为 MEC 士兵"

[UIAlert_MecAugmentationComplete]
m_strAugmentationCompleteLabel="增强完成"

[UIChooseMEC]
m_strTitle=MEC 增强专业化
m_strInventoryLabel=可用专业：
m_strBuy=开始手术

[X2Effect_RepairProtocol]
HealedMessage="+<Heal/> HP 已修复"
